Repository: astralchen/QuickLayoutKit
Catalog: Demo/Demo/Localizable.xcstrings
Source language: en
Languages: ar, zh_hans

# imessage.preview.hideControls
source: Hide Controls
ar: إخفاء عناصر التحكم
zh_hans: 隐藏控件

# imessage.preview.live.bounce
source: Bounce
ar: ارتداد
zh_hans: 来回播放

# imessage.preview.live.loop
source: Loop
ar: تكرار
zh_hans: 循环播放

# imessage.preview.live.off
source: Turn Off Live
ar: إيقاف الصورة الحيّة
zh_hans: 关闭实况

# imessage.preview.live.offState
source: Live Off
ar: الصورة الحيّة متوقفة
zh_hans: 实况已关闭

# imessage.preview.live.on
source: Live
ar: حيّة
zh_hans: 实况

# imessage.preview.live.play
source: Play Live Photo
ar: تشغيل الصورة الحيّة
zh_hans: 播放实况照片

# imessage.preview.live.unavailable
source: Unable to play Live Photo. Turn Live off and on to retry.
ar: تعذر تشغيل الصورة الحيّة. أوقفها ثم أعد تشغيلها للمحاولة مجددًا.
zh_hans: 实况照片无法播放，可关闭后重新开启重试

# imessage.preview.more
source: More
ar: المزيد
zh_hans: 更多

# imessage.preview.mute
source: Mute
ar: كتم الصوت
zh_hans: 静音

# imessage.preview.next
source: Next Attachment
ar: المرفق التالي
zh_hans: 下一个附件

# imessage.preview.pages
source: Page %d of %d
ar: الصفحة %d من %d
zh_hans: 第 %d 页，共 %d 页

# imessage.preview.pause
source: Pause
ar: إيقاف مؤقت
zh_hans: 暂停

# imessage.preview.play
source: Play
ar: تشغيل
zh_hans: 播放

# imessage.preview.position
source: Item %d of %d
ar: العنصر %d من %d
zh_hans: 第 %d 项，共 %d 项

# imessage.preview.previous
source: Previous Attachment
ar: المرفق السابق
zh_hans: 上一个附件

# imessage.preview.progress
source: Playback position
ar: موضع التشغيل
zh_hans: 播放进度

# imessage.preview.unavailable
source: This attachment could not be previewed.
ar: تعذرت معاينة هذا المرفق.
zh_hans: 无法预览此附件。

# imessage.preview.unmute
source: Unmute
ar: إلغاء كتم الصوت
zh_hans: 取消静音

# imessage.reply.1
source: Perfect — see you soon!
ar: رائع، أراك قريبًا!
zh_hans: 好呀，一会儿见！

# imessage.save.completed
source: Saved
ar: تم الحفظ
zh_hans: 已保存

# imessage.save.failed
source: Unable to save the attachment. Please try again.
ar: تعذر حفظ المرفق. حاول مرة أخرى.
zh_hans: 无法保存附件，请重试。

# imessage.save.files
source: Save to Files
ar: حفظ في الملفات
zh_hans: 保存到文件

# imessage.save.permissionDenied
source: Allow adding photos in Settings to save these attachments.
ar: اسمح بإضافة الصور في الإعدادات لحفظ هذه المرفقات.
zh_hans: 请在设置中允许添加照片，以保存这些附件。

# imessage.save.photos
source: Save to Photos
ar: حفظ في الصور
zh_hans: 保存到照片

# imessage.save.saving
source: Saving
ar: جارٍ الحفظ
zh_hans: 正在保存

# imessage.seed.incoming.1
source: Hey! Are we still meeting today?
ar: مرحبًا! هل ما زال موعدنا اليوم قائمًا؟
zh_hans: 嗨！我们今天还是按原计划见面吗？

# imessage.seed.incoming.2
source: Great, I'll be there a few minutes early.
ar: ممتاز، سأصل مبكرًا ببضع دقائق.
zh_hans: 太好了，我会提前几分钟到。

# imessage.seed.link.title
source: Apple — Explore products
ar: Apple — استكشف المنتجات
zh_hans: Apple — 探索产品

# imessage.seed.outgoing.1
source: Absolutely. Seven works for me.
ar: بالتأكيد، الساعة السابعة تناسبني.
zh_hans: 当然，七点我没问题。

# imessage.seed.text.address
source: Meet here: 1 Apple Park Way, Cupertino, CA 95014 北京市朝阳区三里屯路19号 Send me a message when you arrive.
ar: نلتقي هنا: 1 Apple Park Way, Cupertino, CA 95014 北京市朝阳区三里屯路19号 أرسل لي رسالة عند وصولك.
zh_hans: 见面地址： 1 Apple Park Way, Cupertino, CA 95014 北京市朝阳区三里屯路19号 到达后给我发条消息。

# imessage.seed.text.mixed
source: Trip and contact details: Phone: +1 (202) 555-0147 Email: hello@example.com Address: 1 Apple Park Way, Cupertino, CA 95014 Website: https://www.apple.com Time: tomorrow at 3:30 PM Flight: UA123 UPS: 1Z999AA10123456784 Budget: US$25.00 Distance: 10 km; temperature: 72 °F Note: 3 people, 2 copies of the document.
ar: تفاصيل الرحلة والتواصل: الهاتف: +1 (202) 555-0147 البريد: hello@example.com العنوان: 1 Apple Park Way, Cupertino, CA 95014 الموقع: https://www.apple.com الموعد: غدًا الساعة 3:30 مساءً الرحلة: UA123 UPS: 1Z999AA10123456784 الميزانية: US$25.00 المسافة: 10 km؛ الحرارة: 72 °F ملاحظة: 3 أشخاص ونسختان من المستند.
zh_hans: 行程与联系方式： 电话：+1 (202) 555-0147 邮箱：hello@example.com 地址：1 Apple Park Way, Cupertino, CA 95014 网址：https://www.apple.com 时间：明天下午3:30 航班：UA123 UPS：1Z999AA10123456784 预算：US$25.00 距离：10 km，温度：72 °F 备注：共 3 人，带上 2 份资料。

# imessage.seed.text.phone
source: Phone: +1 (202) 555-0147 China: +86 10 5550 1234 These numbers demonstrate phone formats.
ar: الهاتف: +1 (202) 555-0147 الصين: +86 10 5550 1234 هذه أمثلة لتنسيقات أرقام الهاتف.
zh_hans: 联系电话：+1 (202) 555-0147 国内电话：+86 10 5550 1234 以上为演示格式。

# imessage.seed.text.email
source: Send the documents to hello@example.com You can also copy team@example.org.
ar: أرسل المستندات إلى hello@example.com يمكنك أيضًا إرسال نسخة إلى team@example.org.
zh_hans: 资料请发至 hello@example.com 也可以抄送 team@example.org。

# imessage.seed.text.date
source: Let's meet tomorrow at 3:30 PM. We can check in next Monday at 10:00 AM.
ar: نلتقي غدًا الساعة 3:30 مساءً. نراجع التقدم يوم الاثنين القادم الساعة 10:00 صباحًا.
zh_hans: 我们明天下午3:30见面。 下周一上午10:00再确认一下进度。

# imessage.seed.text.flight
source: Flight: UA123 Another flight: CA1831 Flight status depends on the information available to the system.
ar: الرحلة: UA123 رحلة أخرى: CA1831 تعتمد حالة الرحلة على المعلومات المتاحة للنظام.
zh_hans: 航班：UA123 另一班：CA1831 航班状态以系统提供的信息为准。

# imessage.seed.text.shipment
source: UPS tracking number: 1Z999AA10123456784 This example does not represent a real shipment.
ar: رقم تتبع UPS: 1Z999AA10123456784 هذا المثال لا يمثل شحنة حقيقية.
zh_hans: UPS 快递单号：1Z999AA10123456784 这是演示单号，不代表真实包裹。

# imessage.seed.text.money
source: Example prices: US$25.00, €18.50, CN¥120.00. View the currency actions offered by the system.
ar: أسعار توضيحية: US$25.00، €18.50، CN¥120.00. اطّلع على إجراءات العملات التي يتيحها النظام.
zh_hans: 费用参考：US$25.00、€18.50、CN¥120.00。 可查看系统提供的货币操作。

# imessage.seed.text.physicalValue
source: Distance: 10 km Temperature: 72 °F Luggage weight: 3 kg
ar: المسافة: 10 km درجة الحرارة: 72 °F وزن الأمتعة: 3 kg
zh_hans: 距离：10 km 温度：72 °F 行李重量：3 kg

# imessage.seed.text.plain
source: Hello! This is a plain text message. The conversation continues on a new line.
ar: مرحباً! هذه رسالة نصية عادية. تستمر المحادثة في سطر جديد.
zh_hans: 你好！这是一条普通文本消息。 换行后也可以继续阅读。

# imessage.seed.text.url
source: Website: https://www.apple.com Help: https://support.apple.com/en-us The links stay inside the message.
ar: الموقع: https://www.apple.com المساعدة: https://support.apple.com/ar-sa تبقى الروابط ضمن نص الرسالة.
zh_hans: 官网：https://www.apple.com 帮助页面：https://support.apple.com/zh-cn 网址保留在正文里。

# imessage.seed.rich.bold
source: Bold
ar: عريض
zh_hans: 粗体

# imessage.seed.rich.italic
source: Italic
ar: مائل
zh_hans: 斜体

# imessage.seed.rich.mixed
source: Combined formatting
ar: تنسيق مختلط
zh_hans: 混合格式

# imessage.seed.rich.strikethrough
source: Strikethrough
ar: يتوسطه خط
zh_hans: 删除线

# imessage.seed.rich.underline
source: Underline
ar: تسطير
zh_hans: 下划线

# imessage.status.delivered
source: Delivered
ar: تم التسليم
zh_hans: 已送达

# imessage.status.failed
source: Not Delivered
ar: لم يتم التسليم
zh_hans: 尚未送达

# imessage.status.read
source: Read
ar: تمت القراءة
zh_hans: 已读

# imessage.status.retry.hint
source: Double-tap to try sending this message again.
ar: اضغط مرتين لإعادة إرسال هذه الرسالة.
zh_hans: 轻点两下重新发送此消息。

# imessage.status.sending
source: Sending…
ar: جارٍ الإرسال…
zh_hans: 发送中…

# imessage.typing.accessibility
source: Alex is typing
ar: أليكس يكتب
zh_hans: Alex 正在输入

# keyboard.diagnostics.event
source: Event: %@
ar: الحدث: %@
zh_hans: 事件：%@

# keyboard.diagnostics.height
source: Height: %lld
ar: الارتفاع: %lld
zh_hans: 高度：%lld

# keyboard.diagnostics.intersection
source: Intersection: %@
ar: منطقة التقاطع: %@
zh_hans: 交集区域：%@

# keyboard.diagnostics.rawFrame
source: Raw frame: %@
ar: الإطار الأصلي: %@
zh_hans: 原始区域：%@

# keyboard.diagnostics.title
source: Keyboard diagnostics
ar: تشخيص لوحة المفاتيح
zh_hans: 键盘诊断

# keyboard.placeholder
source: Enter text
ar: أدخل نصاً
zh_hans: 输入文本

# language.change.hint
source: Choose a language and watch UIKit plus QuickLayout refresh immediately.
ar: اختر لغة وشاهد تحديث UIKit و QuickLayout فوراً.
zh_hans: 选择语言，观察 UIKit 和 QuickLayout 即时刷新。

# language.current
source: Current Language
ar: اللغة الحالية
zh_hans: 当前语言

# language.direction
source: Interface Direction
ar: اتجاه الواجهة
zh_hans: 界面方向

# language.follow.system
source: Follow System
ar: اتبع النظام
zh_hans: 跟随系统

# language.menu.accessibility
source: Change language
ar: تغيير اللغة
zh_hans: 切换语言

# language.menu.title
source: Language
ar: اللغة
zh_hans: 语言

# liveRoom.action.cancel
source: Cancel
ar: إلغاء
zh_hans: 取消

# liveRoom.action.gift
source: Gift
ar: هدية
zh_hans: 礼物

# liveRoom.action.input.placeholder
source: Write a public message
ar: اكتب رسالة عامة
zh_hans: 输入公屏消息

# liveRoom.action.message
source: Say something nice...
ar: قل شيئاً لطيفاً...
zh_hans: 说点好听的...

# liveRoom.action.microphone
source: Microphone
ar: الميكروفون
zh_hans: 麦克风

# liveRoom.action.more
source: More
ar: المزيد
zh_hans: 更多

# liveRoom.action.send
source: Send
ar: إرسال
zh_hans: 发送

# liveRoom.audience.listening
source: Listening
ar: يستمع
zh_hans: 正在收听

# liveRoom.audience.onMicrophone
source: On mic %lld
ar: على المقعد %lld
zh_hans: %lld 号麦

# liveRoom.audience.openHint
source: Show the people currently in the room
ar: عرض قائمة الموجودين الآن
zh_hans: 查看当前在线用户

# liveRoom.audience.profile.about.title
source: About
ar: نبذة شخصية
zh_hans: 个人简介

# liveRoom.audience.profile.about.value
source: %@ enjoys music and meeting interesting people in the room.
ar: يستمتع %@ بالموسيقى وبالتعرّف إلى أشخاص مميزين في الغرفة.
zh_hans: %@ 喜欢音乐，也喜欢在直播间认识有趣的人。

# liveRoom.audience.profile.avatar
source: %@'s avatar
ar: صورة %@
zh_hans: %@ 的头像

# liveRoom.audience.profile.contribution.title
source: Contribution
ar: قيمة المساهمة
zh_hans: 贡献值

# liveRoom.audience.profile.details.title
source: User details
ar: معلومات المستخدم
zh_hans: 用户资料

# liveRoom.audience.profile.memberID
source: User ID
ar: معرّف المستخدم
zh_hans: 用户 ID

# liveRoom.audience.profile.navigationTitle
source: User profile
ar: الملف الشخصي
zh_hans: 用户主页

# liveRoom.audience.profile.openHint
source: Show this user's profile
ar: عرض الملف الشخصي للمستخدم
zh_hans: 查看该用户的主页

# liveRoom.audience.subtitle
source: Active members currently loaded
ar: الأعضاء النشطون المعروضون حاليًا
zh_hans: 当前已加载的活跃用户

# liveRoom.audience.title
source: People here now
ar: الموجودون الآن
zh_hans: 当前在线

# liveRoom.business.command.failure.message
source: The room state could not be updated. Try again later.
ar: تعذر تحديث حالة الغرفة. حاول مرة أخرى لاحقاً.
zh_hans: 房间状态更新失败，请稍后重试。

# liveRoom.business.command.failure.title
source: Action Failed
ar: فشلت العملية
zh_hans: 操作失败

# liveRoom.business.pk.end
source: End PK
ar: إنهاء التحدي
zh_hans: 结束 PK

# liveRoom.business.pk.start
source: Start PK
ar: بدء التحدي
zh_hans: 发起 PK

# liveRoom.condition.cancel
source: Close audience seats
ar: إغلاق مقاعد الجمهور
zh_hans: 关闭观众席

# liveRoom.condition.met
source: Condition met · four additional seats are visible
ar: تم استيفاء الشرط، تظهر المقاعد الأربعة الأخرى
zh_hans: 条件已满足 · 已显示其余 4 个麦位

# liveRoom.condition.notMet
source: Condition pending · only the main seat is visible
ar: الشرط غير مستوفى، يظهر المقعد الرئيسي فقط
zh_hans: 条件未满足 · 仅显示第一个大麦位

# liveRoom.condition.satisfy
source: Open audience seats
ar: فتح مقاعد الجمهور
zh_hans: 开启观众席

# liveRoom.follow.shortTitle
source: Follow
ar: متابعة
zh_hans: 关注

# liveRoom.gift.balance
source: Balance %lld
ar: الرصيد %lld
zh_hans: 余额 %lld

# liveRoom.gift.balance.insufficient
source: Insufficient · Balance %lld
ar: الرصيد غير كافٍ · الرصيد %lld
zh_hans: 余额不足 · 余额 %lld

# liveRoom.gift.category.all
source: All
ar: الكل
zh_hans: 全部

# liveRoom.gift.category.collection
source: Collection
ar: مقتنيات
zh_hans: 典藏

# liveRoom.gift.category.interactive
source: Interactive
ar: تفاعلي
zh_hans: 互动

# liveRoom.gift.category.luxury
source: Luxury
ar: فاخر
zh_hans: 豪华

# liveRoom.gift.category.multiple
source: Multi-effect
ar: تأثيرات متعددة
zh_hans: 多特效

# liveRoom.gift.category.party
source: Party
ar: حفلة
zh_hans: 派对

# liveRoom.gift.category.popular
source: Popular
ar: شائع
zh_hans: 热门

# liveRoom.gift.category.romantic
source: Romantic
ar: رومانسي
zh_hans: 浪漫

# liveRoom.gift.celebration
source: Luxury Gift · %@
ar: هدية فاخرة · %@
zh_hans: 豪华礼物 · %@

# liveRoom.gift.close
source: Close
ar: إغلاق
zh_hans: 关闭

# liveRoom.gift.item.aurora
source: Aurora
ar: شفق
zh_hans: 极光

# liveRoom.gift.item.auroraDream
source: Aurora Dreamscape
ar: عالم الشفق الحالم
zh_hans: 极光幻境

# liveRoom.gift.item.castle
source: Castle
ar: قلعة
zh_hans: 城堡

# liveRoom.gift.item.constellation
source: Constellation
ar: كوكبة
zh_hans: 星座

# liveRoom.gift.item.crown
source: Crown
ar: تاج
zh_hans: 皇冠

# liveRoom.gift.item.crystal
source: Crystal
ar: بلورة
zh_hans: 水晶

# liveRoom.gift.item.fireworkGala
source: Firework Gala
ar: مهرجان الألعاب النارية
zh_hans: 花火盛典

# liveRoom.gift.item.fireworks
source: Fireworks
ar: ألعاب نارية
zh_hans: 烟花

# liveRoom.gift.item.flowerBouquet
source: Lovely Bouquet
ar: باقة زهور لطيفة
zh_hans: 萌萌花束

# liveRoom.gift.item.flowerDuet
source: Floral Harmony
ar: تناغم الأزهار
zh_hans: 花漾三重奏

# liveRoom.gift.item.flowerJourney
source: Flower Journey
ar: نزهة بين الزهور
zh_hans: 花下与君游

# liveRoom.gift.item.flowerSeaSuite
source: Flower Sea Symphony
ar: سيمفونية بحر الزهور
zh_hans: 花海协奏曲

# liveRoom.gift.item.galaxy
source: Galaxy
ar: مجرة
zh_hans: 银河

# liveRoom.gift.item.galaxyDream
source: Galaxy Dream
ar: حلم المجرة
zh_hans: 星河绮梦

# liveRoom.gift.item.heart
source: Heart
ar: قلب
zh_hans: 心动

# liveRoom.gift.item.microphone
source: Microphone
ar: ميكروفون
zh_hans: 金麦

# liveRoom.gift.item.moonlitVoyage
source: Moonlit Flower Voyage
ar: رحلة الزهور تحت القمر
zh_hans: 月下花舟

# liveRoom.gift.item.music
source: Melody
ar: لحن
zh_hans: 音符

# liveRoom.gift.item.phoenix
source: Phoenix
ar: عنقاء
zh_hans: 凤凰

# liveRoom.gift.item.rhythmParty
source: Heartbeat Party
ar: حفلة نبض القلب
zh_hans: 心动节拍

# liveRoom.gift.item.rocket
source: Rocket
ar: صاروخ
zh_hans: 火箭

# liveRoom.gift.item.rose
source: Rose
ar: وردة
zh_hans: 玫瑰

# liveRoom.gift.item.rosePromise
source: Rose Promise
ar: وعد الورد
zh_hans: 玫瑰誓约

# liveRoom.gift.item.sportsCar
source: Sports Car
ar: سيارة رياضية
zh_hans: 跑车

# liveRoom.gift.item.star
source: Starlight
ar: ضوء النجوم
zh_hans: 星光

# liveRoom.gift.item.treasure
source: Treasure
ar: كنز
zh_hans: 宝藏

# liveRoom.gift.item.universe
source: Universe
ar: كون
zh_hans: 宇宙

# liveRoom.gift.item.yacht
source: Yacht
ar: يخت
zh_hans: 游艇

# liveRoom.gift.price
source: %lld stars
ar: %lld نجمة
zh_hans: %lld 星币

# liveRoom.gift.quantity.accessibility
source: Gift quantity: %lld, %@
ar: كمية الهدية: %lld، %@
zh_hans: 赠送数量：%lld，%@

# liveRoom.gift.quantity.fiveTwenty
source: I Love You
ar: أحبك
zh_hans: 我爱你

# liveRoom.gift.quantity.one
source: Wholeheartedly
ar: إخلاص كامل
zh_hans: 一心一意

# liveRoom.gift.quantity.oneEightyEight
source: Hug Me
ar: أريد عناقًا
zh_hans: 要抱抱

# liveRoom.gift.quantity.sixtySix
source: Smooth Sailing
ar: كل شيء يسير بسلاسة
zh_hans: 一切顺利

# liveRoom.gift.quantity.ten
source: Perfect Ten
ar: كمال تام
zh_hans: 十全十美

# liveRoom.gift.quantity.thirteenFourteen
source: Forever
ar: إلى الأبد
zh_hans: 一生一世

# liveRoom.gift.quantity.thirty
source: Shining Bright
ar: بريق لامع
zh_hans: 闪闪发光

# liveRoom.gift.quantity.title
source: Choose Quantity
ar: اختر الكمية
zh_hans: 选择数量

# liveRoom.gift.recipient.count
source: Send to · %lld selected
ar: إلى من؟ · تم اختيار %lld
zh_hans: 送给谁 · 已选 %lld 人

# liveRoom.gift.recipient.required
source: Select a recipient first
ar: اختر مستلمًا أولاً
zh_hans: 请先选择收礼人

# liveRoom.gift.recipient.title
source: Send to
ar: إلى من؟
zh_hans: 送给谁

# liveRoom.gift.selectAll
source: Select All
ar: تحديد الكل
zh_hans: 全选

# liveRoom.gift.selectAll.cancel
source: Clear All
ar: إلغاء الكل
zh_hans: 取消全选

# liveRoom.gift.selected
source: Selected
ar: محدد
zh_hans: 已选择

# liveRoom.gift.selection.title
source: Choose a gift
ar: اختر هدية
zh_hans: 选择礼物

# liveRoom.gift.send.action
source: Send
ar: إرسال
zh_hans: 赠送

# liveRoom.gift.sent.quantity
source: %@ ×%lld sent to %@
ar: تم إرسال %@ ×%lld إلى %@
zh_hans: 已将%@ ×%lld 送给%@

# liveRoom.gift.summary
source: Send %@ · +%lld value
ar: إهداء %@ · +%lld قيمة
zh_hans: 赠送【%@】礼物 · +%lld 财富值

# liveRoom.gift.title
source: Send a Gift
ar: إرسال هدية
zh_hans: 送礼物

# liveRoom.info.announcement.title
source: Room announcement
ar: إعلان الغرفة
zh_hans: 直播间公告

# liveRoom.info.announcement.value
source: Welcome to the room. Be kind to one another and enjoy the music and conversation.
ar: مرحبًا بكم في الغرفة. احترموا بعضكم واستمتعوا بالموسيقى والدردشة.
zh_hans: 欢迎来到直播间，请友善交流，一起享受音乐和聊天时光。

# liveRoom.info.audience
source: Audience
ar: المشاهدون
zh_hans: 在线人数

# liveRoom.info.avatar.accessibility
source: Room avatar
ar: صورة غرفة البث
zh_hans: 直播间头像

# liveRoom.info.avatar.hint
source: Show room information
ar: عرض معلومات الغرفة
zh_hans: 查看直播间信息

# liveRoom.info.details.title
source: Room details
ar: تفاصيل الغرفة
zh_hans: 房间资料

# liveRoom.info.host
source: Host
ar: المضيف
zh_hans: 主播

# liveRoom.info.navigationTitle
source: Room information
ar: معلومات الغرفة
zh_hans: 直播间信息

# liveRoom.info.roomID
source: Room ID
ar: معرّف الغرفة
zh_hans: 房间号

# liveRoom.info.status.live
source: Live now
ar: مباشر الآن
zh_hans: 直播中

# liveRoom.layout.five
source: Solo room
ar: غرفة بث فردي
zh_hans: 个播房

# liveRoom.layout.nine
source: Party room
ar: غرفة حفلة
zh_hans: 派对房

# liveRoom.layout.pk
source: Room PK
ar: منافسة الغرف
zh_hans: 厅 PK

# liveRoom.layout.title
source: Room mode
ar: وضع الغرفة
zh_hans: 房间玩法

# liveRoom.messages.first
source: Lina: Your voice sounds lovely today ✨
ar: لينا: صوتك جميل اليوم ✨
zh_hans: 小满：今晚的声音也太温柔了 ✨

# liveRoom.messages.follow
source: Follow room
ar: متابعة الغرفة
zh_hans: 关注直播间

# liveRoom.messages.followed
source: Following
ar: تمت المتابعة
zh_hans: 已关注

# liveRoom.messages.followRequesting
source: Following…
ar: جارٍ المتابعة…
zh_hans: 关注中…

# liveRoom.messages.me
source: Me: %@
ar: أنا: %@
zh_hans: 我：%@

# liveRoom.messages.second
source: Adam: Waiting for the next song 🎵
ar: آدم: ننتظر الأغنية التالية 🎵
zh_hans: 阿澈：坐等下一首歌 🎵

# liveRoom.messages.third
source: Room: Be kind and enjoy the show
ar: النظام: يرجى التفاعل بلطف والاستمتاع بالبث
zh_hans: 直播间：友善互动，一起享受此刻

# liveRoom.messages.title
source: Live chat
ar: الدردشة المباشرة
zh_hans: 直播互动

# liveRoom.messages.unfollowRequesting
source: Unfollowing…
ar: جارٍ إلغاء المتابعة…
zh_hans: 取消关注中…

# liveRoom.pk.current
source: This room
ar: هذه الغرفة
zh_hans: 本房

# liveRoom.pk.opponent
source: Opponent
ar: الغرفة المنافسة
zh_hans: 对方

# liveRoom.pk.seatDescription
source: %@ · Seat %lld
ar: %@ · المقعد %lld
zh_hans: %@ · %lld 号麦

# liveRoom.pk.user.0
source: Opponent 0
ar: مستخدم 0
zh_hans: 清风

# liveRoom.pk.user.1
source: Opponent 1
ar: مستخدم 1
zh_hans: 小雨

# liveRoom.pk.user.2
source: Opponent 2
ar: مستخدم 2
zh_hans: 星辰

# liveRoom.pk.user.3
source: Opponent 3
ar: مستخدم 3
zh_hans: 晚风

# liveRoom.pk.user.4
source: Opponent 4
ar: مستخدم 4
zh_hans: 明月

# liveRoom.pk.user.5
source: Opponent 5
ar: مستخدم 5
zh_hans: 空麦

# liveRoom.pk.user.6
source: Opponent 6
ar: مستخدم 6
zh_hans: 青禾

# liveRoom.pk.user.7
source: Opponent 7
ar: مستخدم 7
zh_hans: 云朵

# liveRoom.pk.user.8
source: Opponent 8
ar: مستخدم 8
zh_hans: 空麦

# liveRoom.publicChat.arrival
source: {user} joined the room
ar: انضم {user} إلى الغرفة
zh_hans: 欢迎 {user} 进入房间

# liveRoom.publicChat.gift
source: {sender} sent {gift} ×{quantity} to each of {recipients}
ar: أرسل {sender} {gift} ×{quantity} لكل من {recipients}
zh_hans: {sender} 送给 {recipients} {gift} ×{quantity}／人

# liveRoom.publicChat.hello
source: Found a lovely room. Staying here to listen 🎧
ar: وجدت غرفة رائعة، سأبقى للاستماع 🎧
zh_hans: 发现一个宝藏房间，坐下来听歌啦 🎧

# liveRoom.publicChat.host
source: Host
ar: المضيف
zh_hans: 房主

# liveRoom.publicChat.hostWelcome
source: Good evening! What would you like to hear tonight? 🎵
ar: مساء الخير! ماذا تحبون أن تسمعوا الليلة؟ 🎵
zh_hans: 晚上好呀，今晚想听什么歌？🎵

# liveRoom.publicChat.me
source: Me
ar: أنا
zh_hans: 我

# liveRoom.publicChat.song
source: Your voice is so soothing. Looking forward to the next song ✨
ar: صوتك هادئ وجميل، بانتظار الأغنية التالية ✨
zh_hans: 声音好温柔，期待下一首歌 ✨

# liveRoom.publicChat.thanks
source: Thank you for the hearts! This next song is for you 💜
ar: شكرًا على القلوب! الأغنية التالية لكم 💜
zh_hans: 谢谢送来的小心心，下一首送给大家 💜

# liveRoom.publicChat.unread
source: %lld new messages ↓
ar: %lld رسائل جديدة ↓
zh_hans: 有 %lld 条新消息 ↓

# liveRoom.publicChat.welcome
source: Welcome! Be kind, respect each other, and enjoy the music.
ar: مرحبًا! لنتحدث بلطف ونحترم بعضنا ونستمتع بالموسيقى.
zh_hans: 欢迎来到语音房，请友善交流，一起享受好声音。

# liveRoom.recharge.alert.action
source: Top Up
ar: شحن الرصيد
zh_hans: 去充值

# liveRoom.recharge.alert.cancel
source: Not Now
ar: ليس الآن
zh_hans: 暂不充值

# liveRoom.recharge.alert.message
source: Your balance is %1$lld. This gift requires %2$lld. Top up to continue.
ar: رصيدك الحالي %1$lld، وهذه الهدية تحتاج %2$lld. اشحن رصيدك للمتابعة.
zh_hans: 当前余额 %1$lld，本次赠送需要 %2$lld。充值后可继续赠送。

# liveRoom.recharge.alert.title
source: Insufficient Balance
ar: الرصيد غير كافٍ
zh_hans: 余额不足

# liveRoom.recharge.balance.title
source: Current Balance
ar: الرصيد الحالي
zh_hans: 当前余额

# liveRoom.recharge.balance.value
source: %lld Coins
ar: %lld عملة
zh_hans: %lld 星币

# liveRoom.recharge.confirm
source: Top Up %lld Coins
ar: شحن %lld عملة
zh_hans: 充值 %lld 星币

# liveRoom.recharge.failure
source: Top-up failed. Please try again.
ar: تعذر إتمام الشحن. حاول مرة أخرى.
zh_hans: 充值失败，请稍后重试

# liveRoom.recharge.package.amount
source: %lld Coins
ar: %lld عملة
zh_hans: %lld 星币

# liveRoom.recharge.package.bonus
source: +%lld Bonus
ar: +%lld مكافأة
zh_hans: 加赠 %lld

# liveRoom.recharge.package.selected
source: Selected
ar: محدد
zh_hans: 已选中

# liveRoom.recharge.package.standard
source: Standard Credit
ar: الرصيد الأساسي
zh_hans: 基础星币

# liveRoom.recharge.package.title
source: Choose a Top-up Package
ar: اختر باقة شحن
zh_hans: 选择充值档位

# liveRoom.recharge.page.title
source: Top Up
ar: شحن الرصيد
zh_hans: 充值中心

# liveRoom.recharge.required
source: This gift requires a balance of %lld
ar: تحتاج هذه الهدية إلى رصيد %lld
zh_hans: 本次赠送需要余额 %lld

# liveRoom.recharge.success
source: %lld coins added
ar: تمت إضافة %lld عملة
zh_hans: 充值成功，已到账 %lld 星币

# liveRoom.room.audience
source: %lld watching
ar: %lld يشاهدون
zh_hans: %lld 人在线

# liveRoom.room.subtitle
source: Singing · stories · good company
ar: غناء ودردشة لطيفة
zh_hans: 唱歌 · 聊天 · 遇见有趣的人

# liveRoom.room.title
source: Starlight Music Room
ar: ليلة النجوم
zh_hans: 星光音乐小屋

# liveRoom.seat.available
source: Available
ar: متاح
zh_hans: 待上麦

# liveRoom.seat.eight
source: VIP Seat
ar: مقعد مميز
zh_hans: 专属座

# liveRoom.seat.muted
source: Microphone muted
ar: الميكروفون مغلق
zh_hans: 麦克风已关闭

# liveRoom.seat.speaking
source: Microphone open
ar: الميكروفون مفتوح
zh_hans: 麦克风已开启

# liveRoom.user.host
source: Aurora
ar: أورورا
zh_hans: 星河

# liveRoom.user.individual.1
source: Xiaoman
ar: شياومان
zh_hans: 小满

# liveRoom.user.individual.2
source: A-Che
ar: آ تشه
zh_hans: 阿澈

# liveRoom.user.individual.3
source: Dango
ar: دانغو
zh_hans: 团子

# liveRoom.user.individual.4
source: Tsukimi
ar: تسوكيمي
zh_hans: 月见

# liveRoom.user.party.1
source: Lina
ar: لينا
zh_hans: 喜茶

# liveRoom.user.party.2
source: Adam
ar: آدم
zh_hans: 奈雪

# liveRoom.user.party.3
source: Coco
ar: كوكو
zh_hans: 可可

# liveRoom.user.party.4
source: Nora
ar: نورا
zh_hans: 沐橙

# liveRoom.user.party.5
source: Xiaoman
ar: شياومان
zh_hans: 小满

# liveRoom.user.party.6
source: A-Che
ar: آ تشه
zh_hans: 阿澈

# liveRoom.userCard.guestSeat
source: Seat %lld
ar: المقعد %lld
zh_hans: %lld 号麦

# liveRoom.userCard.hostSeat
source: Host seat
ar: مقعد المضيف
zh_hans: 主播麦位

# liveRoom.userCard.title
source: User Profile
ar: بطاقة المستخدم
zh_hans: 用户卡片
